## Filtering, Sorting and Grouping
Percentage of the bachelor degrees women in the USA

In [3]:
import pandas as pd

In [27]:
data = pd.DataFrame({'program': ["Ingeniería de mecanica", "Ingenieria industrial", "Ingenieria sistemas", 
                                 "Bacteriología", "Finanzas y negocios internacionales", "Derecho", "Ingeniería alimentos", 
                                 "Ingeniería ambiental"],
                     'age': [35, 30, 57, 65, 25, 19, 20, 65],
                     'salary': [160000, 90000, 250000, 170000, 70000, 100000, 145000, 80000],
                     'students': [600, 400, 250, 320, 800, 180, 220, 295],
                     'faculty': ["Ingenierías", "Ingenierías", "Ingenierías", "Salud", "CEJA", "CEJA", "Ingenierías", "Ingenierías"]
                    })

In [28]:
data.sort_values(by='salary', ascending=False)

                               program  age  salary  students      faculty
2                  Ingenieria sistemas   57  250000       250  Ingenierías
3                        Bacteriología   65  170000       320        Salud
0               Ingeniería de mecanica   35  160000       600  Ingenierías
6                 Ingeniería alimentos   20  145000       220  Ingenierías
5                              Derecho   19  100000       180         CEJA
1                Ingenieria industrial   30   90000       400  Ingenierías
7                 Ingeniería ambiental   65   80000       295  Ingenierías
4  Finanzas y negocios internacionales   25   70000       800         CEJA

In [29]:
data.sort_values(by='salary', ascending=True)

                               program  age  salary  students      faculty
4  Finanzas y negocios internacionales   25   70000       800         CEJA
7                 Ingeniería ambiental   65   80000       295  Ingenierías
1                Ingenieria industrial   30   90000       400  Ingenierías
5                              Derecho   19  100000       180         CEJA
6                 Ingeniería alimentos   20  145000       220  Ingenierías
0               Ingeniería de mecanica   35  160000       600  Ingenierías
3                        Bacteriología   65  170000       320        Salud
2                  Ingenieria sistemas   57  250000       250  Ingenierías

In [31]:
data.groupby('faculty').count()

             program  age  salary  students
faculty
CEJA               2    2       2         2
Ingenierías        5    5       5         5
Salud              1    1       1         1

In [33]:
# Count()
data.groupby('faculty')["program"].count()

faculty
CEJA           2
Ingenierías    5
Salud          1
Name: program, dtype: int64

In [37]:
# Mean
data.groupby('faculty')['age'].mean()

faculty
CEJA           22.0
Ingenierías    41.4
Salud          65.0
Name: age, dtype: float64

In [38]:
# Min
data.groupby('faculty')['age'].min()

faculty
CEJA           19
Ingenierías    20
Salud          65
Name: age, dtype: int64

In [40]:
# Max
data.groupby('faculty')['age'].max()

faculty
CEJA           25
Ingenierías    65
Salud          65
Name: age, dtype: int64

In [41]:
# Max
data.groupby('faculty')['salary'].max()

faculty
CEJA           100000
Ingenierías    250000
Salud          170000
Name: salary, dtype: int64

In [62]:
# Create a condition. Filter based in a condition
data['salary'] > 100000

0     True
1    False
2     True
3     True
4    False
5    False
6     True
7    False
Name: salary, dtype: bool

In [52]:
# type(data['salary'] > 100000)

data[data['salary'] > 100000]

                  program  age  salary  students      faculty
0  Ingeniería de mecanica   35  160000       600  Ingenierías
2     Ingenieria sistemas   57  250000       250  Ingenierías
3           Bacteriología   65  170000       320        Salud
6    Ingeniería alimentos   20  145000       220  Ingenierías

In [61]:
data[(data['salary'] > 100000) & (data['age'] > 40)]
# (data[data['salary']] > 100000) and (data[data['age']] > 40)

               program  age  salary  students      faculty
2  Ingenieria sistemas   57  250000       250  Ingenierías
3        Bacteriología   65  170000       320        Salud

In [65]:
data

                               program  age  salary  students      faculty
0               Ingeniería de mecanica   35  160000       600  Ingenierías
1                Ingenieria industrial   30   90000       400  Ingenierías
2                  Ingenieria sistemas   57  250000       250  Ingenierías
3                        Bacteriología   65  170000       320        Salud
4  Finanzas y negocios internacionales   25   70000       800         CEJA
5                              Derecho   19  100000       180         CEJA
6                 Ingeniería alimentos   20  145000       220  Ingenierías
7                 Ingeniería ambiental   65   80000       295  Ingenierías

In [67]:
# data
# data['age'].isin([35,30])
data[ data['age'].isin([35,30]) ]

                  program  age  salary  students      faculty
0  Ingeniería de mecanica   35  160000       600  Ingenierías
1   Ingenieria industrial   30   90000       400  Ingenierías